In [5]:
import pandas as pd
import sqlite3
import json
import os

print(f"Python is currently looking in: {os.getcwd()}")
print(f"Files in this folder: {os.listdir('.')}")

# Load orders
orders = pd.read_csv("orders.csv")

# Load users
with open("users.json", "r") as f:
    users_data = json.load(f)

users = pd.json_normalize(users_data)

# Create in-memory database
conn = sqlite3.connect(":memory:")

# Load SQL schema
with open(r"C:\Users\hp\Downloads\Project\restaurant.sql", "r") as f:
    sql_script = f.read()

conn.executescript(sql_script)

# Read restaurants table
restaurants = pd.read_sql_query("SELECT * FROM restaurants", conn)

# Merge datasets
merged_df = (
    orders
    .merge(users, on="user_id", how="left")
    .merge(restaurants, on="restaurant_id", how="left")
)

# Save final dataset
merged_df.to_csv("final_food_delivery_dataset.csv", index=False)

print("Final dataset created successfully!")

Python is currently looking in: C:\Users\hp\Downloads\Project
Files in this folder: ['.ipynb_checkpoints', 'orders.csv', 'restaurant.sql', 'Untitled.ipynb', 'users.json']
Final dataset created successfully!

In [6]:
merged_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0